IDS_RUS_CODE_REPORT_EN_TEST = "EC_Report_EN-Test(Lang:EN)"
IDS_RUS_DLL_ERROR = "Incorrect dll version is being linked"
IDS_RUS_DLL_ERROR_REPORT = "Could not initialize COM dll"
IDS_CVL_REPORT_PRINTING = "Printing Report..."
IDS_CVL_REPORT_GENERATING = "Generating Report..."
IDS_CVL_RPT_SNiP_Spartial_Section = "Calculation of strength the spatial element sections"
IDS_CVL_RPT_SNiP_Not_required = "Not required"
IDS_SP16_Par711_Title = "Calculation of the strength of elements under central tension or compression (par. 7.1.1)"
IDS_SP16_Par713_Title = "Calculation of stability of solid section elements under central compression (par. 7.1.3)"
IDS_SP16_Par715_Title = "Stability under bending-torsional stability loss of an open section (par. 7.1.5)"
IDS_SP16_Par723_Title = "Calculation of the conditional flexibility of the branch (par. 7.2.3)"
IDS_SP16_Par724_Title = "Calculation of stability of individual branches in combined section elements (par. 7.2.4)"
IDS_SP16_Par732_Title = "Stability of walls of centrally compressed solid section elements (par. 7.3.2)"
IDS_SP16_Par733_Title = "The walls of centrally compressed solid section elements should be reinforced with transverse ribs (par. 7.3.3)"
IDS_SP16_Par733_CrossRibsNotSet = "o_lambda_w > 2.3\n\nCross ribs are required, but not set."
IDS_SP16_Par733_CheckCrossRibFrequency = "o_lambda_w > 2.3\n\nCross ribs are required and set. Checking the sufficiency of the cross ribs frequency:"
IDS_SP16_Par733_CrossRibsAreNotRequired = "o_lambda_w <= 2.3\n\nCross ribs are not required."
IDS_SP16_Par738_Title = "Stability of chord sheets of centrally compressed solid section elements (par. 7.3.8)"
IDS_SP16_Par821_Title = "Strength calculation of class 1 beams: under the action of a moment (par. 8.2.1)"
IDS_SP16_ParTau_Title = "Checking the section for shear forces"
IDS_SP16_Par823_Title = "Strength calculation of split beams of the 2nd and 3rd classes of I-beam and box sections: under the action of a moment (par. 8.2.3)"
IDS_SP16_Par841_Title = "Calculation of stability of I-beams of class 1: under the action of a moment (par. 8.4.1)"
IDS_SP16_Par851_Title = "Stability of beam walls of class 1: under the action of a moment (par. 8.5.1)"
IDS_SP16_Par853_Title = "Stability of beam walls of class 1 symmetrical cross-section in the presence of local stress: under the action of a moment (par. 8.5.3)"
IDS_SP16_Par857_Title = "Stability of the walls of class 1 beams of an asymmetric I-section with a more developed tension flange (par. 8.5.7)"
IDS_SP16_Par858_Title = "Stability of beam walls of 2nd and 3rd class made of homogeneous steel in the absence of local stress (Sigma_loc = 0) (par. 8.5.8)"
IDS_SP16_Par822_Title = "Calculation of the strength of a beam wall not reinforced with stiffeners under the action of local stress (par. 8.2.2)"
IDS_SP16_Par8518_Title = "Stability of compressed chords of class 1 beams (par. 8.5.18)"
IDS_SP16_Par8519_Title = "Stability of compressed chords of beams of class 2, 3 (par. 8.5.19)"
IDS_SP16_Par911_Title = "Strength calculation of eccentrically compressed and eccentrically stretched elements (par. 9.1.1)"
IDS_SP16_Par913_Title = "Testing the tensile strength of the fiber section of eccentrically compressed elements with asymmetrical sections (par. 9.1.3)"
IDS_SP16_Par922_Title = "Calculation of stability of eccentrically compressed elements in the plane of action of the moment, coinciding with the plane of symmetry (par. 9.2.2)"
IDS_SP16_Par928_Title = "Calculation of stability of eccentrically compressed elements bent in the plane of least rigidity (par. 9.2.8)"
IDS_SP16_Par929_Title = "Calculation of stability of rods (except box-shaped) subjected to compression and bending in two main planes (par. 9.2.9)"
IDS_SP16_Par9210_Title = "Calculation of the stability of rods (box-shaped) subjected to compression and bending in two main planes (par. 9.2.10)"
IDS_SP16_Par924_Title = "Calculation of the stability of eccentrically compressed rods from the plane of action of the moment during their bending in the plane of greatest rigidity (par. 9.2.4)"
IDS_SP16_Par942_Title = "Stability of walls of eccentrically compressed elements (par. 9.4.2)"
IDS_SP16_Par947_Title = "Stability of belts (shelves) of eccentrically compressed rods (par. 9.4.7)"
IDS_SP16_Par1041_Title = "Maximum design lengths of elements (par. 10.4.1)"
IDS_SP16_Par1122_Title = "Calculation of the stability of the walls of seamless or electric-welded pipes (par. 11.2.2)"
IDS_SP16_Par1122_FurtherChecksAreNotNeeded = "o_lambda < 0.65\n Further checks are not needed."
IDS_SP16_COEFFS_FOR_SECTION_TYPE = "For type %s section coefficients are: %s"
IDS_SP16_COEFFS_FOR_UNKNOWN_SECTION_TYPE = "Unknown section type. Coefficients are: %s"
IDS_SP16_CALC_LAMBDA_EF_COMBINED_SECTION = "Calculation of the flexibility lambda_ef of a through-section element"
IDS_SP16_COMB_SECT_TYPE1_BRANCHES_WITH_PLANKS = "Section type: 1, branches are connected with planks"
IDS_SP16_COMB_SECT_TYPE1_BRANCHES_WITH_LATTICE = "Section type: 1, branches are connected with lattice"
IDS_SP16_CALC_PHI_COEFF = "Calculation of the phi coefficient"
IDS_SP16_CALC_PHI_E_REG_ELEMENT = "Calculation of the stability coefficient phi_e under eccentric compression of solid elements"
IDS_SP16_CALC_PHI_E_FROM_D3_TABLE = "From D.3 table for o_lambda_ef = %g and m = %g"
IDS_SP16_CALC_PHI_E_COMB_ELEMENT = "Calculation of the stability coefficient phi_e under eccentric compression of through elements"
IDS_SP16_CALC_PHI_E_FROM_D4_TABLE = "From D.4 table for o_lambda_ef = %g and m = %g"
IDS_SP16_CALC_REDUCED_AREA_AD = "Calculation of the reduced area Ad"
IDS_SP16_SECT_TYPE_TABLE_7 = "Type of section from table 7:"
IDS_SP16_REQUIREMENTS_OF_732_NOT_SATISFIED = "The requirements of paragraph 7.3.2 are not met. Calculation with reduced area."
IDS_SP16_REQUIREMENTS_OF_942_NOT_SATISFIED = "The requirements of paragraph 9.4.2 are not met. Calculation with reduced area."
IDS_SP16_CALCULATION_OF_TABLE_9 = "Calculation of ultimate conditional web flexibility (table 9)."
IDS_SP16_CALCULATION_OF_TABLE_10 = "Calculation of ultimate conditional flange flexibility (table 10)."
IDS_SP16_CALCULATION_OF_HD_CENTRALLY_COMPRESSED = "Calculation of hd for centrally compressed element"
IDS_SP16_CALCULATION_OF_HD_CENTRALLY_UNCOMPRESSED = "Calculation of hd for centrally uncompressed element"
IDS_SP16_CALCULATION_OF_BD = "Calculation of bd"
IDS_SP16_CALCULATION_OF_TABLE_D6 = "Calculation of ω, α, β from table D.6"
IDS_SP16_CALCULATION_OF_CMAX_SECT_TYPE_4 = "Calculation of Cmax coefficient. Section type: 4"
IDS_SP16_CALCULATION_OF_TABLE_E1 = "Calculation of coefficients Cy, Cz, n (table E.1)."
IDS_SP16_FOR_AF_AW_MSG = "For Af = %g, Aw = %g"
IDS_SP16_CALCULATION_TABLE_ZH4 = "Calculation of coefficient B (table ZH.4)."
IDS_SP16_CALCULATION_TABLE_ZH5 = "Calculation of C and D coefficients (table ZH.5)."
IDS_SP16_UNIT_LENGTH_MM = "mm"
IDS_SP16_UNIT_LENGTH_CM = "cm"
IDS_SP16_UNIT_LENGTH_M = "m"
IDS_SP16_UNIT_LENGTH_IN = "in"
IDS_SP16_UNIT_LENGTH_FT = "ft"
IDS_SP16_UNIT_FORCE_KG = "kgf"
IDS_SP16_UNIT_FORCE_TON = "tonf"
IDS_SP16_UNIT_FORCE_N = "N"
IDS_SP16_UNIT_FORCE_KN = "kN"
IDS_SP16_UNIT_FORCE_LBF = "lbf"
IDS_SP16_UNIT_FORCE_KIP = "kip"
IDS_SP16_UNIT_FORCE_KIPs = "kips"
IDS_SP16_RATIO = "rat"
IDS_SNiP_REPORT_SECT_REDESIGN = "The section must be redesigned."
IDS_SNiP_REPORT_NOT_REQ_REBAR = "∴ Reinforcement isn't required."
IDS_SNiP_REPORT_REQ_REBAR = "∴ Reinforcement is required."
IDS_RUS_CODE_REPORT_CH_TEST = "RUS_Report_CH-Test(Lang:CH)"
IDS_RUS_CODE_REPORT_JP_TEST = "EC_Report_JP-Test(Lang:JP)"
IDS_RUS_CODE_REPORT_KR_TEST = "EC_Report_KR-Test(Lang:KR)"
IDS_RUS_CODE_RUS_TEST = "EC_Report_RUS-Test(Lang:RUS)"
IDS_RUS_CODE_REPORT_TW_TEST = "EC_Report_TW-Test(Lang:TW)"
IDS_SP16_BIG_MY_LINEAR_INTERPOLATION_NOTE = "The value of m_y is > 5. The value of %s is determined by linear interpolation."
